out/log_fanout/ab_fanout100_run1.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking projectcloud-479410.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        projectcloud-479410.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        projectcloud-479410.ew.r.appspot.com

Document Path:          /api/timeline?user=fanout100_1&limit=20
Document Length:        44 bytes

Concurrency Level:      50
Time taken for tests:   63.680 seconds
Complete requests:      500
Failed requests:        2
   (Connect: 0, Receive: 0, Length: 2, Exceptions: 0)
Non-2xx responses:      2
Total transferred:      157644 bytes
HTML transferred:       22558 bytes
Requests per second:    7.85 [#/sec] (mean)
Time per request:       6367.984 [ms] (mean)
Time per request:       127.360 [ms] (mean, across all concurrent requests)
Transfer rate:          2.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       42   56  30.0     47     327
Processing:  1679 5167 3774.0   3784   25728
Waiting:     1679 5167 3774.0   3784   25728
Total:       1724 5223 3773.3   3845   25774

Percentage of the requests served within a certain time (ms)
  50%   3845
  66%   4998
  75%   6330
  80%   7704
  90%  11283
  95%  12826
  98%  14607
  99%  19295
 100%  25774 (longest request)