out/log_fanout/ab_fanout100_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking projectcloud-479410.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        projectcloud-479410.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        projectcloud-479410.ew.r.appspot.com

Document Path:          /api/timeline?user=fanout100_1&limit=20
Document Length:        44 bytes

Concurrency Level:      50
Time taken for tests:   60.741 seconds
Complete requests:      500
Failed requests:        11
   (Connect: 0, Receive: 0, Length: 11, Exceptions: 0)
Non-2xx responses:      11
Total transferred:      160176 bytes
HTML transferred:       25069 bytes
Requests per second:    8.23 [#/sec] (mean)
Time per request:       6074.053 [ms] (mean)
Time per request:       121.481 [ms] (mean, across all concurrent requests)
Transfer rate:          2.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       39   56  28.5     47     348
Processing:    28 4946 4513.1   2497   23247
Waiting:       28 4946 4513.2   2497   23247
Total:         89 5002 4512.2   2544   23289

Percentage of the requests served within a certain time (ms)
  50%   2544
  66%   4046
  75%   6724
  80%  10044
  90%  12113
  95%  12871
  98%  20193
  99%  21465
 100%  23289 (longest request)