out/log_fanout/ab_fanout10_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking projectcloud-479410.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        projectcloud-479410.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        projectcloud-479410.ew.r.appspot.com

Document Path:          /api/timeline?user=fanout10_1&limit=20
Document Length:        43 bytes

Concurrency Level:      50
Time taken for tests:   3.724 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      156504 bytes
HTML transferred:       21500 bytes
Requests per second:    134.27 [#/sec] (mean)
Time per request:       372.391 [ms] (mean)
Time per request:       7.448 [ms] (mean, across all concurrent requests)
Transfer rate:          41.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       39   55  23.3     48     332
Processing:    45  286 107.3    265     538
Waiting:       44  286 107.3    265     538
Total:         88  341 107.2    320     653

Percentage of the requests served within a certain time (ms)
  50%    320
  66%    407
  75%    429
  80%    440
  90%    481
  95%    521
  98%    560
  99%    589
 100%    653 (longest request)