out/log_fanout/ab_fanout10_run3.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking projectcloud-479410.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        projectcloud-479410.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        projectcloud-479410.ew.r.appspot.com

Document Path:          /api/timeline?user=fanout10_1&limit=20
Document Length:        43 bytes

Concurrency Level:      50
Time taken for tests:   3.419 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      156500 bytes
HTML transferred:       21500 bytes
Requests per second:    146.24 [#/sec] (mean)
Time per request:       341.900 [ms] (mean)
Time per request:       6.838 [ms] (mean, across all concurrent requests)
Transfer rate:          44.70 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       41   56  21.2     49     277
Processing:    43  260  59.1    266     396
Waiting:       43  259  59.1    266     396
Total:         92  316  57.6    318     556

Percentage of the requests served within a certain time (ms)
  50%    318
  66%    338
  75%    353
  80%    360
  90%    380
  95%    400
  98%    424
  99%    480
 100%    556 (longest request)