out/log_fanout/ab_fanout50_run3.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking projectcloud-479410.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        projectcloud-479410.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        projectcloud-479410.ew.r.appspot.com

Document Path:          /api/timeline?user=fanout50_1&limit=20
Document Length:        43 bytes

Concurrency Level:      50
Time taken for tests:   36.412 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      156540 bytes
HTML transferred:       21500 bytes
Requests per second:    13.73 [#/sec] (mean)
Time per request:       3641.249 [ms] (mean)
Time per request:       72.825 [ms] (mean, across all concurrent requests)
Transfer rate:          4.20 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       41   56  23.9     47     280
Processing:   854 2722 2518.3   1753   12221
Waiting:      854 2722 2518.3   1753   12221
Total:        902 2778 2517.0   1807   12272

Percentage of the requests served within a certain time (ms)
  50%   1807
  66%   2323
  75%   3064
  80%   3772
  90%   7209
  95%   9249
  98%  10537
  99%  10797
 100%  12272 (longest request)